<a href="https://colab.research.google.com/github/bchabros/machine_learning_bootcamp/blob/main/supervised/01_basics/03_feature_extraction.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Ekstracja cech

In [1]:
import numpy as np
import pandas as pd
import sklearn

Pobranie notowan spolki Amazon

In [2]:
def fetch_financial_data(company='AMZN'):
  import pandas_datareader.data as web
  return web.DataReader(name=company,
                        data_source='stooq')
  
df_raw = fetch_financial_data()
df_raw.head()

                 Open      High      Low    Close   Volume
Date
2021-11-24  3562.6700  3613.640  3536.85  3580.41  2328018
2021-11-23  3585.0400  3621.050  3527.71  3580.04  3692246
2021-11-22  3676.3768  3713.455  3567.50  3572.57  4847850
2021-11-19  3712.6900  3762.145  3675.72  3676.57  4946203
2021-11-18  3566.3500  3704.200  3561.00  3696.06  5703538

In [3]:
df = df_raw.copy()
df = df[:5]
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 5 entries, 2021-11-24 to 2021-11-18
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Open    5 non-null      float64
 1   High    5 non-null      float64
 2   Low     5 non-null      float64
 3   Close   5 non-null      float64
 4   Volume  5 non-null      int64
dtypes: float64(4), int64(1)
memory usage: 240.0 bytes

In [5]:
df['day'] = df.index.day
df['month'] = df.index.month
df['year'] = df.index.year
df

                 Open      High      Low    Close   Volume  day  month  year
Date
2021-11-24  3562.6700  3613.640  3536.85  3580.41  2328018   24     11  2021
2021-11-23  3585.0400  3621.050  3527.71  3580.04  3692246   23     11  2021
2021-11-22  3676.3768  3713.455  3567.50  3572.57  4847850   22     11  2021
2021-11-19  3712.6900  3762.145  3675.72  3676.57  4946203   19     11  2021
2021-11-18  3566.3500  3704.200  3561.00  3696.06  5703538   18     11  2021

Dyskretyzacja zmiennej ciaglej

In [6]:
df = pd.DataFrame(data={'height': [175., 178.5, 185., 191., 184.5, 183., 168.]})
df

   height
0   175.0
1   178.5
2   185.0
3   191.0
4   184.5
5   183.0
6   168.0

In [8]:
df['height_cat'] = pd.cut(x=df.height, bins=3)
df

   height          height_cat
0   175.0  (167.977, 175.667]
1   178.5  (175.667, 183.333]
2   185.0    (183.333, 191.0]
3   191.0    (183.333, 191.0]
4   184.5    (183.333, 191.0]
5   183.0  (175.667, 183.333]
6   168.0  (167.977, 175.667]

In [9]:
df['height_cat'] = pd.cut(x=df.height, bins=(160, 175, 180, 195), 
                          labels=['small', 'medium', 'high'])
df

   height height_cat
0   175.0      small
1   178.5     medium
2   185.0       high
3   191.0       high
4   184.5       high
5   183.0       high
6   168.0      small

In [10]:
pd.get_dummies(df, drop_first=True, prefix='height')

   height  height_medium  height_high
0   175.0              0            0
1   178.5              1            0
2   185.0              0            1
3   191.0              0            1
4   184.5              0            1
5   183.0              0            1
6   168.0              0            0

Ekstracja Cech

In [11]:
df = pd.DataFrame(data={'lang': [['PL', 'ENG'], ['GER', 'ENG', 'PL', 'FRA'], ['RUS']]})
df

                  lang
0            [PL, ENG]
1  [GER, ENG, PL, FRA]
2                [RUS]

In [12]:
df['lang_number'] = df['lang'].apply(len)
df

                  lang  lang_number
0            [PL, ENG]            2
1  [GER, ENG, PL, FRA]            4
2                [RUS]            1

In [13]:
df['PL_flag'] = df['lang'].apply(lambda x: 1 if 'PL' in x else 0)
df

                  lang  lang_number  PL_flag
0            [PL, ENG]            2        1
1  [GER, ENG, PL, FRA]            4        1
2                [RUS]            1        0

In [14]:
 df = pd.DataFrame(data={'website': ['wp.pl', 'onet.pl', 'google.com']})
 df

      website
0       wp.pl
1     onet.pl
2  google.com

In [15]:
df.website.str.split('.', expand=True)

        0    1
0      wp   pl
1    onet   pl
2  google  com

In [16]:
new = df.website.str.split('.', expand=True)
df['portal'] = new[0]
df['extension'] = new[1]
df

      website  portal extension
0       wp.pl      wp        pl
1     onet.pl    onet        pl
2  google.com  google       com